In [4]:
import numpy as np
import pandas as pd
import math

In [5]:
data = r"C:\Users\ASUS\Dropbox\PC\Desktop\HDSC 2022\Datasets\FoodBalanceSheets_E_Africa_NOFLAG.csv"
df = pd.read_csv(data)

In [6]:
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [7]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [14]:
df.shape

(60943, 12)

In [9]:
df.describe(include = 'all')

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943,60943.000000,60943,60943.000000,60943,60943,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
unique,NaN,49,NaN,119,NaN,18,5,NaN,NaN,NaN,NaN,NaN
top,NaN,Kenya,NaN,Milk - Excluding Butter,NaN,Domestic supply quantity,1000 tonnes,NaN,NaN,NaN,NaN,NaN
freq,NaN,1560,NaN,1262,NaN,5295,40933,NaN,NaN,NaN,NaN,NaN
mean,134.265576,NaN,2687.176706,NaN,3814.856456,NaN,NaN,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,NaN,146.055739,NaN,2212.007033,NaN,NaN,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,NaN,2501.000000,NaN,511.000000,NaN,NaN,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,NaN,2562.000000,NaN,684.000000,NaN,NaN,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,NaN,2630.000000,NaN,5142.000000,NaN,NaN,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,NaN,2775.000000,NaN,5511.000000,NaN,NaN,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,NaN,2961.000000,NaN,5911.000000,NaN,NaN,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60943 entries, 0 to 60942
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Area Code     60943 non-null  int64
 1   Area          60943 non-null  object
 2   Item Code     60943 non-null  int64
 3   Item          60943 non-null  object
 4   Element Code  60943 non-null  int64
 5   Element       60943 non-null  object
 6   Unit          60943 non-null  object
 7   Y2014         59354 non-null  float64
 8   Y2015         59395 non-null  float64
 9   Y2016         59408 non-null  float64
 10  Y2017         59437 non-null  float64
 11  Y2018         59507 non-null  float64
dtypes: float64(5), int64(3), object(4)
memory usage: 5.6+ MB

In [11]:
duplicate_rows_count = df[df.duplicated()].shape

In [12]:
duplicate_rows_count

(0, 12)

# solutions of 11 - 20 QUESTIONS

### 11. What is the total sum of Animal Fat produced in 2014 and 2017 respectively?

In [89]:
df.groupby('Item').sum().loc['Animal fats',['Y2014','Y2017']]

Y2014    209460.54
Y2017    269617.53
Name: Animal fats, dtype: float64

### 12 What is the mean and standard deviation across the whole dataset for the year 2015 to 3 decimal places?

In [91]:
df.describe().loc[['mean','std'],'Y2015']

mean     135.235966
std     1603.403984
Name: Y2015, dtype: float64

### 13 What is the total number and percentage of missing data in 2016 to 2 decimal places?

In [92]:
total_number = df['Y2016'].isna().sum()
total_number

1535

In [36]:
total_percent = (total_number/df.shape[0])*100
round(total_percent,2)

2.52

### 14 Which year had the highest correlation with ‘Element Code’?

In [95]:
df.corr().loc['Element Code',['Y2014','Y2015','Y2016','Y2017','Y2018']].sort_values()

Y2016    0.023444
Y2015    0.023889
Y2017    0.024254
Y2018    0.024279
Y2014    0.024457
Name: Element Code, dtype: float64

In [ ]:
#answer is 2014

### 15  What year has the highest sum of Import Quantity?

In [88]:

df.groupby('Element').sum().loc['Import Quantity',['Y2014','Y2015','Y2016','Y2017','Y2018']].sort_values()

Y2015    267018.46
Y2014    274144.48
Y2016    286582.78
Y2018    287997.09
Y2017    294559.09
Name: Import Quantity, dtype: float64

In [ ]:
# 2017  is the answer

### 16 What is the total number of the sum of Production in 2014?

In [81]:

df.groupby('Element').sum().loc['Production','Y2014']

1931287.7500000005

### 17 Which of these elements had the highest sum in 2018?

In [96]:

df.loc[:,['Y2018','Element']].groupby('Element').sum().sort_values(by='Y2018').iloc[-1]

Y2018    2161192.1
Name: Domestic supply quantity, dtype: float64

### 18 Which of these elements had the 3rd lowest sum in 2018?

In [98]:
 
df.loc[:,['Y2018','Element']].groupby('Element').sum().sort_values(by='Y2018').iloc[:3]

                                           Y2018
Element
Tourist consumption                        90.00
Fat supply quantity (g/capita/day)      10258.69
Protein supply quantity (g/capita/day)  11833.56

### 19 What is the total Import Quantity in Algeria in 2018?

In [74]:

df.groupby('Area').sum().loc['Algeria','Y2018']

341729.9800000005

### 20 What is the total number of unique countries in the dataset?

In [63]:

df['Area'].unique().size

49